Tekla Open API Reference for Tekla Structures 2025
CannotPerformOperationDrawingNotUpToDateException Class
 The CannotPerformOperationDrawingNotUpToDateException class defines the exception that is thrown when a user tries to do an operation which requires that the drawing is active.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotPerformOperationDrawingNotUpToDateException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CannotPerformOperationDrawingNotUpToDateException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class CannotPerformOperationDrawingNotUpToDateException
	Inherits TeklaStructuresDrawingsApplicationException
The CannotPerformOperationDrawingNotUpToDateException type exposes the following members.
Constructors
Name | Description
CannotPerformOperationDrawingNotUpToDateException
 Creates a new cannot perform operation drawing not up to date exception instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace